## Staging: export 💾
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 42 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                                                           NAME                                                                            |
|--------|-----------------------------------------------------------------------------------------------------------------------------------------------------------|
| add    | `module.platform_notify_export.aws_cloudwatch_log_metric_filter.platform_gc_notify`                                                                       |
|        | `module.platform_notify_export.aws_cloudwatch_metric_alarm.platform_gc_notify_error_logged`                                                               |
|        | `module.platform_notify_export.aws_cloudwatch_metric_alarm.platform_gc_notify_errors`                                                                     |
|        | `module.platform_notify_export.aws_iam_policy.platform_notify_rds_snapshot_exports`                                                                       |
|        | `module.platform_notify_export.aws_iam_role.platform_notify_rds_snapshot_exports`                                                                         |
|        | `module.platform_notify_export.aws_iam_role_policy_attachment.platform_notify_rds_snapshot_exports`                                                       |
|        | `module.platform_notify_export.aws_kms_alias.platform_notify_rds_snapshot_exports`                                                                        |
|        | `module.platform_notify_export.aws_kms_key.platform_notify_rds_snapshot_exports`                                                                          |
|        | `module.platform_support_freshdesk_export.aws_cloudwatch_log_metric_filter.platform_support_freshdesk_export`                                             |
|        | `module.platform_support_freshdesk_export.aws_cloudwatch_metric_alarm.platform_support_freshdesk_export_error_logged`                                     |
|        | `module.platform_support_freshdesk_export.aws_cloudwatch_metric_alarm.platform_support_freshdesk_export_errors`                                           |
|        | `module.platform_support_freshdesk_export.aws_ssm_parameter.freshdesk_api_key`                                                                            |
|        | `module.platform_notify_export.module.platform_gc_notify_export.aws_cloudwatch_event_rule.this`                                                           |
|        | `module.platform_notify_export.module.platform_gc_notify_export.aws_cloudwatch_event_target.this`                                                         |
|        | `module.platform_notify_export.module.platform_gc_notify_export.aws_ecr_lifecycle_policy.this[0]`                                                         |
|        | `module.platform_notify_export.module.platform_gc_notify_export.aws_ecr_repository.this[0]`                                                               |
|        | `module.platform_notify_export.module.platform_gc_notify_export.aws_lambda_permission.this`                                                               |
|        | `module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.aws_cloudwatch_event_rule.this`                                        |
|        | `module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.aws_cloudwatch_event_target.this`                                      |
|        | `module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.aws_ecr_lifecycle_policy.this[0]`                                      |
|        | `module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.aws_ecr_repository.this[0]`                                            |
|        | `module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.aws_lambda_permission.this`                                            |
|        | `module.platform_notify_export.module.platform_gc_notify_export.module.this_lambda.aws_cloudwatch_log_group.this`                                         |
|        | `module.platform_notify_export.module.platform_gc_notify_export.module.this_lambda.aws_cloudwatch_query_definition.lambda_statistics`                     |
|        | `module.platform_notify_export.module.platform_gc_notify_export.module.this_lambda.aws_iam_policy.non_vpc_policies[0]`                                    |
|        | `module.platform_notify_export.module.platform_gc_notify_export.module.this_lambda.aws_iam_policy.policies[0]`                                            |
|        | `module.platform_notify_export.module.platform_gc_notify_export.module.this_lambda.aws_iam_role.this`                                                     |
|        | `module.platform_notify_export.module.platform_gc_notify_export.module.this_lambda.aws_iam_role_policy_attachment.attachments[0]`                         |
|        | `module.platform_notify_export.module.platform_gc_notify_export.module.this_lambda.aws_iam_role_policy_attachment.lambda_insights[0]`                     |
|        | `module.platform_notify_export.module.platform_gc_notify_export.module.this_lambda.aws_iam_role_policy_attachment.non_vpc_policies[0]`                    |
|        | `module.platform_notify_export.module.platform_gc_notify_export.module.this_lambda.aws_lambda_function.this`                                              |
|        | `module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.module.this_lambda.aws_cloudwatch_log_group.this`                      |
|        | `module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.module.this_lambda.aws_cloudwatch_query_definition.lambda_statistics`  |
|        | `module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.module.this_lambda.aws_iam_policy.non_vpc_policies[0]`                 |
|        | `module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.module.this_lambda.aws_iam_policy.policies[0]`                         |
|        | `module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.module.this_lambda.aws_iam_policy.policies[1]`                         |
|        | `module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.module.this_lambda.aws_iam_role.this`                                  |
|        | `module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.module.this_lambda.aws_iam_role_policy_attachment.attachments[0]`      |
|        | `module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.module.this_lambda.aws_iam_role_policy_attachment.attachments[1]`      |
|        | `module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.module.this_lambda.aws_iam_role_policy_attachment.lambda_insights[0]`  |
|        | `module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.module.this_lambda.aws_iam_role_policy_attachment.non_vpc_policies[0]` |
|        | `module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.module.this_lambda.aws_lambda_function.this`                           |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/data-lake/actions/runs/14999656983).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.platform_notify_export.aws_cloudwatch_log_metric_filter.platform_gc_notify will be created
  + resource "aws_cloudwatch_log_metric_filter" "platform_gc_notify" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/platform-gc-notify-export"
      + name           = "platform-gc-notify-export-error"
      + pattern        = "ERROR"

      + metric_transformation {
          + default_value = "0"
          + name          = "platform-gc-notify-export-error"
          + namespace     = "data-lake"
          + unit          = "Count"
          + value         = "1"
        }
    }

  # module.platform_notify_export.aws_cloudwatch_metric_alarm.platform_gc_notify_error_logged will be created
  + resource "aws_cloudwatch_metric_alarm" "platform_gc_notify_error_logged" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:123456789012:mock-alarm-topic",
        ]
      + alarm_description                     = "Errors logged over 1 minute by the Platform / GC Notify export."
      + alarm_name                            = "platform-gc-notify-export-error-logged"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "platform-gc-notify-export-error"
      + namespace                             = "data-lake"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:123456789012:mock-ok-topic",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # module.platform_notify_export.aws_cloudwatch_metric_alarm.platform_gc_notify_errors will be created
  + resource "aws_cloudwatch_metric_alarm" "platform_gc_notify_errors" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:123456789012:mock-alarm-topic",
        ]
      + alarm_description                     = "Errors metric over 1 minute by the Platform / GC Notify export."
      + alarm_name                            = "platform-gc-notify-export-errors"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "FunctionName" = "platform-gc-notify-export"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Errors"
      + namespace                             = "AWS/Lambda"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:123456789012:mock-ok-topic",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # module.platform_notify_export.aws_iam_policy.platform_notify_rds_snapshot_exports will be created
  + resource "aws_iam_policy" "platform_notify_rds_snapshot_exports" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "platform-notify-export"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "sts:AssumeRole"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:iam::239043911459:role/NotifyExportToPlatformDataLake"
                      + Sid      = "STSAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
    }

  # module.platform_notify_export.aws_iam_role.platform_notify_rds_snapshot_exports will be created
  + resource "aws_iam_role" "platform_notify_rds_snapshot_exports" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Trigger exports of Notify RDS snapshots to the Data Lake"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "platform-notify-export"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.platform_notify_export.aws_iam_role_policy_attachment.platform_notify_rds_snapshot_exports will be created
  + resource "aws_iam_role_policy_attachment" "platform_notify_rds_snapshot_exports" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "platform-notify-export"
    }

  # module.platform_notify_export.aws_kms_alias.platform_notify_rds_snapshot_exports will be created
  + resource "aws_kms_alias" "platform_notify_rds_snapshot_exports" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/platform-notify-rds-snapshot-exports"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.platform_notify_export.aws_kms_key.platform_notify_rds_snapshot_exports will be created
  + resource "aws_kms_key" "platform_notify_rds_snapshot_exports" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "Encrypt Notify RDS Snapshot exports"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::454671348950:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                  + {
                      + Action    = [
                          + "kms:RetireGrant",
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:Encrypt",
                          + "kms:DescribeKey",
                          + "kms:Decrypt",
                          + "kms:CreateGrant",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS     = "arn:aws:iam::239043911459:role/NotifyExportToPlatformDataLake"
                          + Service = "glue.amazonaws.com"
                        }
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + rotation_period_in_days            = (known after apply)
      + tags_all                           = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
    }

  # module.platform_support_freshdesk_export.data.aws_iam_policy_document.platform_support_freshdesk_export will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "platform_support_freshdesk_export" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ssm:GetParameter*",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "GetSSMParameters"
        }
    }

  # module.platform_support_freshdesk_export.aws_cloudwatch_log_metric_filter.platform_support_freshdesk_export will be created
  + resource "aws_cloudwatch_log_metric_filter" "platform_support_freshdesk_export" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/platform-support-freshdesk-export"
      + name           = "platform-support-freshdesk-export-error"
      + pattern        = "ERROR"

      + metric_transformation {
          + default_value = "0"
          + name          = "platform-support-freshdesk-export-error"
          + namespace     = "data-lake"
          + unit          = "Count"
          + value         = "1"
        }
    }

  # module.platform_support_freshdesk_export.aws_cloudwatch_metric_alarm.platform_support_freshdesk_export_error_logged will be created
  + resource "aws_cloudwatch_metric_alarm" "platform_support_freshdesk_export_error_logged" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:123456789012:mock-alarm-topic",
        ]
      + alarm_description                     = "Errors logged over 1 minute by the Platform / Support / Freshdesk export."
      + alarm_name                            = "platform-support-freshdesk-export-error-logged"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "platform-support-freshdesk-export-error"
      + namespace                             = "data-lake"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:123456789012:mock-ok-topic",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # module.platform_support_freshdesk_export.aws_cloudwatch_metric_alarm.platform_support_freshdesk_export_errors will be created
  + resource "aws_cloudwatch_metric_alarm" "platform_support_freshdesk_export_errors" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:123456789012:mock-alarm-topic",
        ]
      + alarm_description                     = "Errors metric over 1 minute by the Platform / Support / Freshdesk export."
      + alarm_name                            = "platform-support-freshdesk-export-errors"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "FunctionName" = "platform-support-freshdesk-export"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Errors"
      + namespace                             = "AWS/Lambda"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:123456789012:mock-ok-topic",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # module.platform_support_freshdesk_export.aws_ssm_parameter.freshdesk_api_key will be created
  + resource "aws_ssm_parameter" "freshdesk_api_key" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/platform/support/freshdesk-api-key"
      + tags_all       = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # module.platform_notify_export.module.platform_gc_notify_export.aws_cloudwatch_event_rule.this will be created
  + resource "aws_cloudwatch_event_rule" "this" {
      + arn                 = (known after apply)
      + description         = "Triggers Lambda platform-gc-notify-export on a schedule"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "platform-gc-notify-export-schedule"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 0 1 1 1 1970)"
      + tags                = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + tags_all            = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
    }

  # module.platform_notify_export.module.platform_gc_notify_export.aws_cloudwatch_event_target.this will be created
  + resource "aws_cloudwatch_event_target" "this" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = "platform-gc-notify-export-schedule"
      + target_id      = "platform-gc-notify-export"
    }

  # module.platform_notify_export.module.platform_gc_notify_export.aws_ecr_lifecycle_policy.this[0] will be created
  + resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep most recent 10 images"
                      + rulePriority = 10
                      + selection    = {
                          + countNumber = 10
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "platform-gc-notify-export"
    }

  # module.platform_notify_export.module.platform_gc_notify_export.aws_ecr_repository.this[0] will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "platform-gc-notify-export"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + tags_all             = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.platform_notify_export.module.platform_gc_notify_export.aws_lambda_permission.this will be created
  + resource "aws_lambda_permission" "this" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "platform-gc-notify-export"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromEventBridge-platform-gc-notify-export"
      + statement_id_prefix = (known after apply)
    }

  # module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.aws_cloudwatch_event_rule.this will be created
  + resource "aws_cloudwatch_event_rule" "this" {
      + arn                 = (known after apply)
      + description         = "Triggers Lambda platform-support-freshdesk-export on a schedule"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "platform-support-freshdesk-export-schedule"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 0 1 1 1 1970)"
      + tags                = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + tags_all            = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
    }

  # module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.aws_cloudwatch_event_target.this will be created
  + resource "aws_cloudwatch_event_target" "this" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = "platform-support-freshdesk-export-schedule"
      + target_id      = "platform-support-freshdesk-export"
    }

  # module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.aws_ecr_lifecycle_policy.this[0] will be created
  + resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep most recent 10 images"
                      + rulePriority = 10
                      + selection    = {
                          + countNumber = 10
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "platform-support-freshdesk-export"
    }

  # module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.aws_ecr_repository.this[0] will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "platform-support-freshdesk-export"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + tags_all             = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.platform_support_freshdesk_export.module.platform_support_freshdesk_export.aws_lambda_permission.this will be created
  + resource "aws_lambda_permission" "this" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "platform-support-freshdesk-export"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromEventBridge-platform-support-freshdesk-export"
      + statement_id_prefix = (known after apply)
    }

  # module.platform_notify_export.module.platform_gc_notify_export.module.this_lambda.data.aws_iam_policy_document.non_vpc_policies[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "non_vpc_policies" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "CloudWatchAccess"
        }
      + statement {
          + actions   = [
              + "ecr:BatchGetImage",
              + "ecr:GetDownloadUrlForlayer",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "ECRImageAccess"
        }
    }

  # module.platform_notify_export.module.platform_gc_notify_export.module.this_lambda.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/platform-gc-notify-export"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
    }

  # module.platform_notify_export.module.platform_gc_notify_export.module.this_lambda.aws_cloudwatch_query_definition.lambda_statistics will be created
  + resource "aws_cloudwatch_query_definition" "lambda_statistics" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/aws/lambda/platform-gc-notify-export",
        ]
      + name                = "Lambda Statistics / platform-gc-notify-export"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            filter @type = “REPORT”
            | stats
            count(@type) as countInvocations,
            count(@initDuration) as countColdStarts, (count(@initDuration)/count(@type))*100 as percentageColdStarts,
            max(@initDuration) as maxColdStartTime,
            avg(@duration) as averageDuration,
            max(@duration) as maxDuration,
            min(@duration) as minDuration,
            avg(@maxMemoryUsed) as averageMemoryUsed,
            max(@memorySize) as memoryAllocated, (avg(@maxMemoryUsed)/max(@memorySize))*100 as percentageMemoryUsed
            by bin(1h) as timeFrame
        EOT
    }

  # module.platform_notify_export.module.platform_gc_notify_export.module.this_lambda.aws_iam_policy.non_vpc_policies[0] will be created
  + resource "aws_iam_policy" "non_vpc_policies" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "platform-gc-notify-export_non_vpc"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
    }

  # module.platform_notify_export.module.platform_gc_notify_export.module.this_lambda.aws_iam_policy.policies[0] will be created
  + resource "aws_iam_policy" "policies" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "platform-gc-notify-export-0"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "sts:AssumeRole"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:iam::239043911459:role/NotifyExportToPlatformDataLake"
                      + Sid      = "STSAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
    }

  # module.platform_notify_export.module.platform_gc_notify_export.module.this_lambda.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "platform-gc-notify-export"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.platform_notify_export.module.platform_gc_notify_export.module.this_lambda.aws_iam_role_policy_attachment.attachments[0] will be created
  + resource "aws_iam_role_policy_attachment" "attachments" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "platform-gc-notify-export"
    }

  # module.platform_notify_export.module.platform_gc_notify_export.module.this_lambda.aws_iam_role_policy_attachment.lambda_insights[0] will be created
  + resource "aws_iam_role_policy_attachment" "lambda_insights" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/CloudWatchLambdaInsightsExecutionRolePolicy"
      + role       = "platform-gc-notify-export"
    }

  # module.platform_notify_export.module.platform_gc_notify_export.module.this_lambda.aws_iam_role_policy_attachment.non_vpc_policies[0] will be created
  + resource "aws_iam_role_policy_attachment" "non_vpc_policies" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "platform-gc-notify-export"
    }

  # module.platform_notify_export.module.platform_gc_notify_export.module.this_lambda.aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      +...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["module.platform_notify_export.aws_cloudwatch_metric_alarm.platform_gc_notify_error_logged"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_notify_export.aws_cloudwatch_metric_alarm.platform_gc_notify_errors"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_notify_export.aws_iam_policy.platform_notify_rds_snapshot_exports"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_notify_export.aws_iam_role.platform_notify_rds_snapshot_exports"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_notify_export.aws_kms_key.platform_notify_rds_snapshot_exports"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_support_freshdesk_export.aws_cloudwatch_metric_alarm.platform_support_freshdesk_export_error_logged"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_support_freshdesk_export.aws_cloudwatch_metric_alarm.platform_support_freshdesk_export_errors"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_support_freshdesk_export.aws_ssm_parameter.freshdesk_api_key"]

27 tests, 19 passed, 8 warnings, 0 failures, 0 exceptions

```

</details>
